Тест1/src/Documents/ВыводДенегИзРазборки/ВыводДенегИзРазборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыводДенегИзРазборки</name>
  <registerRecords>AccumulationRegister.ОтданоСМашины</registerRecords>
  <registerRecords>AccumulationRegister.МаратуНаличкой</registerRecords>
  <registerRecords>AccumulationRegister.ВыводС1Января</registerRecords>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>Кому</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Нам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марату</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоОткатов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кто</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Artem</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаратуНаличкой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Таблица</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПродажаЗапчастей</types>
      </type>
    </attributes>
    <attributes>
      <name>нам</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>марату</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>итогсум</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Artem</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаратуНаличкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/Documents/ВыводДенегИзРазборки/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОтданоСМашины Приход
	Если Нам > 0 Тогда
		Движения.ОтданоСМашины.Записывать = Истина;
		Движение = Движения.ОтданоСМашины.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Машина = Машина;
		Движение.Кто = 2;
		Движение.Сумма = Нам;
	КонецЕсли;
	Если Марату > 0 Тогда
		Движения.ОтданоСМашины.Записывать = Истина;
		Движение = Движения.ОтданоСМашины.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Машина = Машина;
		Движение.Кто = 1;
		Движение.Сумма = Марату;
	КонецЕсли;
	
	Если Artem > 0 Тогда
		Движения.ОтданоСМашины.Записывать = Истина;
		Движение = Движения.ОтданоСМашины.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Машина = Машина;
		Движение.Кто = 3;
		Движение.Сумма = Artem;
	КонецЕсли;
	
	тДата = '20160101';
	Если Дата > тДата Тогда		
		Если Нам > 0 Тогда
			Движения.ВыводС1Января.Записывать = ИСТИНА;
			Движение = Движения.ВыводС1Января.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		    Движение.Период = Дата;
	        Движение.Кто = 2;
			Движение.Сумма = Нам;
		КонецЕсли;
		
		Если МаратуНаличкой > 0 Тогда
			Движения.ВыводС1Января.Записывать = ИСТИНА;
			Движение = Движения.ВыводС1Января.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		    Движение.Период = Дата;
	        Движение.Кто = 1;
			Движение.Сумма = МаратуНаличкой;
		КонецЕсли;
	КонецЕсли;	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
